[{"text": "....One person lost to this invisible virus is too much, it should have been stopped at its source, China, but I acted very quickly, and made the right decisions. Many of the current political complainers thought, at the time, that I was moving far to fast, like Crazy Nancy!", "created_at": "Tue May 26 15:18:23 +0000 2020", "id_str": "1265301261903106054"}, {"text": "For all of the political hacks out there, if I hadn’t done my job well, &amp; early, we would have lost 1 1/2 to 2 Million People, as opposed to the 100,000 plus that looks like will be the number. That’s 15 to 20 times more than we will lose. I shut down entry from China very early!", "created_at": "Tue May 26 15:18:20 +0000 2020", "id_str": "1265301249630654467"}, {"text": "We made most Governors look very good, even great, by getting them the Ventilators, unlimited Testing, and supplies, all of which they should have had in their own stockpiles. So they look great, and I just keep rolling along, doing great things and getting Fake Lamestream News!", "created_at": "Tue May 26 15:01:26 +0000 2020", "id_str": "1265296994056183809"}, {"text": "Great reviews on our handling of Covid 19, sometimes referred to as the China Virus. Ventilators, Testing, Medical Supply Distribution, we made a lot of Governors look very good - And got no credit for so doing. Most importantly, we helped a lot of great people!", "created_at": "Mon May 25 20:16:06 +0000 2020", "id_str": "1265013797334507521"}, {"text": "Nobody in 50 years has been WEAKER on China than Sleepy Joe Biden. He was asleep at the wheel. He gave them EVERYTHING they wanted, including rip-off Trade Deals. I am getting it all back!", "created_at": "Mon May 25 20:05:34 +0000 2020", "id_str": "1265011145879977985"}, {"text": "Sleepy Joe Biden (mostly his reps.) went crazy when I banned, in late January, people coming in from China. He called me “xenophobic” &amp; then went equally “nuts” when we let in 44,000 people - until he was told they were American citizens coming home. He later apologized!", "created_at": "Mon May 25 20:00:26 +0000 2020", "id_str": "1265009852516110336"}, {"text": "I give, and have given from the beginning, my entire yearly salary, $400,000 to $450,000, back to our government. Last check to HHS Covid relief. My great honor! https://t.co/Vv6Uyz9MkF", "created_at": "Mon May 25 01:57:23 +0000 2020", "id_str": "1264737293249794048"}, {"text": "The United States cannot have all Mail In Ballots. It will be the greatest Rigged Election in history. People grab them from mailboxes, print thousands of forgeries and “force” people to sign. Also, forge names. Some absentee OK, when necessary. Trying to use Covid for this Scam!", "created_at": "Sun May 24 14:08:36 +0000 2020", "id_str": "1264558926021959680"}, {"text": "The Wacky Do Nothing Attorney General of Michigan, Dana Nessel, is viciously threatening Ford Motor Company for the fact that I inspected a Ventilator plant without a mask. Not their fault, &amp; I did put on a mask. No wonder many auto companies left Michigan, until I came along!", "created_at": "Fri May 22 03:14:05 +0000 2020", "id_str": "1263669433366728704"}, {"text": "I will be lowering the flags on all Federal Buildings and National Monuments to half-staff over the next three days in memory of the Americans we have lost to the CoronaVirus....", "created_at": "Thu May 21 22:41:20 +0000 2020", "id_str": "1263600794290417670"}, {"text": "China is on a massive disinformation campaign because they are desperate to have Sleepy Joe Biden win the presidential race so they can continue to rip-off the United States, as they have done for decades, until I came along!", "created_at": "Thu May 21 01:37:02 +0000 2020", "id_str": "1263282623939477511"}, {"text": "Spokesman speaks stupidly on behalf of China, trying desperately to deflect the pain and carnage that their country spread throughout the world. Its disinformation and propaganda attack on the United States and Europe is a disgrace....", "created_at": "Thu May 21 01:36:30 +0000 2020", "id_str": "1263282490099326978"}, {"text": "Some wacko in China just released a statement blaming everybody other than China for the Virus which has now killed hundreds of thousands of people. Please explain to this dope that it was the “incompetence of China”, and nothing else, that did this mass Worldwide killing!", "created_at": "Wed May 20 12:35:39 +0000 2020", "id_str": "1263085979491016708"}, {"text": "“The Massive Trump Coronavirus Supply Effort that the Media Loves to Hate” @RichLowry https://t.co/VChm4ELmKZ", "created_at": "Tue May 19 16:49:50 +0000 2020", "id_str": "1262787562206367744"}, {"text": "Wow! The Front Page @washingtonpost Headline reads, “A BOOST IN TESTS, BUT LACK OF TAKERS.” We have done a great job on Ventilators, Testing, and everything else. Were left little by Obama. Over 11 million tests, and going up fast. More than all countries in the world, combined.", "created_at": "Mon May 18 12:47:40 +0000 2020", "id_str": "1262364231288197123"}, {"text": "REOPEN OUR COUNTRY!", "created_at": "Mon May 18 12:38:05 +0000 2020", "id_str": "1262361817373958145"}, {"text": "The number of Coronavirus cases is strongly trending downward throughout the United States, with few exceptions. Very good news, indeed!", "created_at": "Sun May 17 22:56:25 +0000 2020", "id_str": "1262155040107704328"}, {"text": "Doing REALLY well, medically, on solving the CoronaVirus situation (Plague!). It will happen!", "created_at": "Sun May 17 14:01:31 +0000 2020", "id_str": "1262020427582451717"}, {"text": ".....are therefore given massive advantages over The United States, and everyone else? Prior to the Plague floating in from China, our Economy was blowing everybody away, the best of any country, EVER. We will be there again, and soon!", "created_at": "Sat May 16 22:58:23 +0000 2020", "id_str": "1261793147069366279"}, {"text": "Why is it that China, for decades, and with a population much bigger than ours, is paying a tiny fraction of $’s to The World Health Organization, The United Nations and, worst of all, The World Trade Organization, where they are considered a so-called “developing country” and...", "created_at": "Sat May 16 22:58:20 +0000 2020", "id_str": "1261793132020224005"}, {"text": "We’ve done a GREAT job on Covid response, making all Governors look good, some fantastic (and that’s OK), but the Lamestream Media doesn’t want to go with that narrative, and the Do Nothing Dems talking point is to say only bad about “Trump”. I made everybody look good, but me!", "created_at": "Sat May 16 13:30:37 +0000 2020", "id_str": "1261650261862383616"}, {"text": "Lou, this is just one of numerous concepts being considered under which we would pay 10% of what we have been paying over many years, matching much lower China payments. Have not made final decision. All funds are frozen. Thanks! https://t.co/xQUzHy4NDa", "created_at": "Sat May 16 12:51:05 +0000 2020", "id_str": "1261640314709774338"}, {"text": "I am proud to announce that the United States will donate ventilators to our friends in India. We stand with India and @narendramodi during this pandemic. We’re also cooperating on vaccine development. Together we will beat the invisible enemy!", "created_at": "Fri May 15 18:50:48 +0000 2020", "id_str": "1261368451555360774"}, {"text": "Good numbers coming out of States that are opening. America is getting its life back! Vaccine work is looking VERY promising, before end of year. Likewise, other solutions!", "created_at": "Thu May 14 13:07:56 +0000 2020", "id_str": "1260919777301798912"}, {"text": "As I have said for a long time, dealing with China is a very expensive thing to do. We just made a great Trade Deal, the ink was barely dry, and the World was hit by the Plague from China. 100 Trade Deals wouldn’t make up the difference - and all those innocent lives lost!", "created_at": "Wed May 13 14:33:15 +0000 2020", "id_str": "1260578860992737285"}, {"text": "Remember this, every Governor who has sky high approval on their handling of the Coronavirus, and I am happy for them all, could in no way have gotten those numbers, or had that success, without me and the Federal Governments help. From Ventilators to Testing, we made it happen!", "created_at": "Tue May 12 11:56:26 +0000 2020", "id_str": "1260177007490600960"}, {"text": "Our Testing is the BEST in the World, by FAR! Numbers are coming down in most parts of our Country, which wants to open and get going again. It is happening, safely!", "created_at": "Tue May 12 11:35:12 +0000 2020", "id_str": "1260171664865796097"}, {"text": "Asian Americans are VERY angry at what China has done to our Country, and the World. Chinese Americans are the most angry of all. I don’t blame them!", "created_at": "Tue May 12 11:19:28 +0000 2020", "id_str": "1260167707741368320"}, {"text": "Coronavirus numbers are looking MUCH better, going down almost everywhere. Big progress being made!", "created_at": "Mon May 11 13:56:57 +0000 2020", "id_str": "1259844948960120833"}, {"text": "Great credit being given for our Coronavirus response, except in the Fake News. They are a disgrace to America!", "created_at": "Mon May 11 13:45:17 +0000 2020", "id_str": "1259842012632821767"}, {"text": ".@CBS and their show, @60Minutes, are doing everything within their power, which is far less today than it was in the past, to defend China and the horrible Virus pandemic that was inflicted on the USA and the rest of the World. I guess they want to do business in China!", "created_at": "Sun May 10 23:25:53 +0000 2020", "id_str": "1259625738858303490"}, {"text": "We are getting great marks for the handling of the CoronaVirus pandemic, especially the very early BAN of people from China, the infectious source, entering the USA. Compare that to the Obama/Sleepy Joe disaster known as H1N1 Swine Flu. Poor marks, bad polls - didn’t have a clue!", "created_at": "Sun May 10 11:48:52 +0000 2020", "id_str": "1259450328048709633"}, {"text": "....to it, as appropriate. The Task Force will also be very focused on Vaccines &amp; Therapeutics. Thank you!", "created_at": "Wed May 06 13:06:13 +0000 2020", "id_str": "1258020241063510018"}, {"text": "....produced in the thousands, and we have many to spare. We are helping other countries which are desperate for them. Likewise, after having been left little, we are now doing more testing than all other countries combined, and with superior tests. Face masks &amp; shields,....", "created_at": "Wed May 06 13:06:06 +0000 2020", "id_str": "1258020211883638786"}, {"text": "The White House CoronaVirus Task Force, headed by Vice President Mike Pence, has done a fantastic job of bringing together vast highly complex resources that have set a high standard for others to follow in the future. Ventilators, which were few &amp; in bad shape, are now being....", "created_at": "Wed May 06 13:05:58 +0000 2020", "id_str": "1258020179692445697"}, {"text": "Well run States should not be bailing out poorly run States, using CoronaVirus as the excuse! The elimination of Sanctuary Cities, Payroll Taxes, and perhaps Capital Gains Taxes, must be put on the table. Also lawsuit indemnification &amp; business deductions for restaurants &amp; ent.", "created_at": "Tue May 05 18:37:54 +0000 2020", "id_str": "1257741326650470400"}, {"text": "For the constant criticism from the Do Nothing Democrats and their Fake News partners, here is the newest chart on our great testing “miracle\" compared to other countries. Dems and LameStream Media should be proud of the USA, instead of always ripping us down! https://t.co/8AwnPCNchF", "created_at": "Tue May 05 16:52:10 +0000 2020", "id_str": "1257714716492722176"}, {"text": "MSDNC and FAKE NEWS CNN are going wild trying to protect China!", "created_at": "Mon May 04 22:35:30 +0000 2020", "id_str": "1257438733240094726"}, {"text": "Interesting? By Congress not wanting the special 5 minute testing apparatus, they are saying that they are not “essential”.  In any event, we have great testing capacity, and have performed 6.5 million tests, which is more than every country in the world, combined!", "created_at": "Mon May 04 14:24:08 +0000 2020", "id_str": "1257315077243334656"}, {"text": "Mexico is sadly experiencing very big CoronaVirus problems, and now California, get this, doesn’t want people coming over the Southern Border. A Classic! They are sooo lucky that I am their President. Border is very tight and the Wall is rapidly being built!", "created_at": "Mon May 04 13:42:13 +0000 2020", "id_str": "1257304527843110914"}, {"text": "Getting great reviews, finally, for how well we are handling the pandemic, especially our strong production of desperately needed ventilators, the building of field hospitals &amp; beds, and soon, the great things we are doing on testing. People are really working well together!", "created_at": "Mon May 04 12:19:45 +0000 2020", "id_str": "1257283775375040512"}, {"text": "Intelligence has just reported to me that I was correct, and that they did NOT bring up the CoronaVirus subject matter until late into January, just prior to my banning China from the U.S. Also, they only spoke of the Virus in a very non-threatening, or matter of fact, manner...", "created_at": "Sun May 03 20:18:19 +0000 2020", "id_str": "1257041819097092096"}, {"text": "....Fake News got it wrong again, as always, and tens of thousands of lives were saved by my EARLY BAN of China into our Country. The people that we’re allowed were heavily scrutinized and tested U.S. citizens, and as such, I welcome them with open arms!", "created_at": "Sun May 03 20:18:19 +0000 2020", "id_str": "1257041820124680192"}, {"text": "No reason to turn it down, except politics. We have plenty of testing. Maybe you need a new Doctor over there. Crazy Nancy will use it as an excuse not to show up to work! https://t.co/NucH4dbKBL", "created_at": "Sat May 02 23:04:53 +0000 2020", "id_str": "1256721351722876933"}, {"text": "The Democrats are just, as always, looking for trouble. They do nothing constructive, even in times of crisis. They don’t want to blame their cash cow, China, for the plague. China is blaming Europe. Dr. Fauci will be testifying before the Senate very soon! #DONOTHINGDEMOCRATS https://t.co/fgHuYeiOQY", "created_at": "Sat May 02 23:00:39 +0000 2020", "id_str": "1256720284540981248"}, {"text": "There is tremendous CoronaVirus testing capacity in Washington for the Senators returning to Capital Hill on Monday. Likewise the House, which should return but isn’t because of Crazy Nancy P. The 5 minute Abbott Test will be used. Please inform Dr. Brian P. Monahan. @MarkMeadows", "created_at": "Sat May 02 13:06:53 +0000 2020", "id_str": "1256570859935932416"}, {"text": "Concast (@NBCNews) and Fake News @CNN are going out of their way to say GREAT things about China. They are Chinese puppets who want to do business there. They use USA airwaves to help China. The Enemy of the People!", "created_at": "Fri May 01 15:27:29 +0000 2020", "id_str": "1256243856166850560"}, {"text": "Cryin’ Chuck Schumer was on a late night show using a false talking point over &amp; over again. “We don’t have enough testing ,” he would repeat, when he knows we have done a great job on Testing, just like we have on Ventilators and everything else. He lied, gave NY SALT. Run AOC!", "created_at": "Fri May 01 12:07:51 +0000 2020", "id_str": "1256193615724007425"}, {"text": "The only reason the U.S. has reported one million cases of CoronaVirus is that our Testing is sooo much better than any other country in the World. Other countries are way behind us in Testing, and therefore show far fewer cases!", "created_at": "Wed Apr 29 04:23:38 +0000 2020", "id_str": "1255352014042738688"}, {"text": "Many States moving to SAFELY &amp; QUICKLY reopen!", "created_at": "Tue Apr 28 13:38:54 +0000 2020", "id_str": "1255129366234890240"}, {"text": "We are doing far more, and better, Testing than any other country in the world, and yet the media does nothing but complain. No matter how good a job is done, the same as with the Ventilators, they will never say we are doing a great job, they will only viciously gripe!", "created_at": "Tue Apr 28 12:06:03 +0000 2020", "id_str": "1255105998471249923"}, {"text": "I work from early in the morning until late at night, haven’t left the White House in many months (except to launch Hospital Ship Comfort) in order to take care of Trade Deals, Military Rebuilding etc., and then I read a phony story in the failing @nytimes about my work....", "created_at": "Sun Apr 26 18:28:35 +0000 2020", "id_str": "1254477490678104064"}, {"text": "I work from early in the morning until late at night, haven’t left the White House in many months (except to launch Hospital Ship Comfort) in order to take care of Trade Deals, Military Rebuilding etc., and then I read a phony story in the failing @nytimes about my work.....", "created_at": "Sun Apr 26 18:17:32 +0000 2020", "id_str": "1254474709674143749"}, {"text": "Was just informed that the Fake News from the Thursday White House Press Conference had me speaking &amp; asking questions of Dr. Deborah Birx. Wrong, I was speaking to our Laboratory expert, not Deborah, about sunlight etc. &amp; the CoronaVirus. The Lamestream Media is corrupt &amp; sick!", "created_at": "Sat Apr 25 20:30:42 +0000 2020", "id_str": "1254145835450933249"}, {"text": "The Do Nothing Democrats are spending much of their money on Fake Ads. I never said that the CoronaVirus is a “Hoax”, I said that the Democrats, and the way they lied about it, are a Hoax. Also, it did start with “one person from China”, and then grew, &amp; will be a “Miracle” end!", "created_at": "Sat Apr 25 15:06:08 +0000 2020", "id_str": "1254064154954076163"}, {"text": "It is a wonderful feeling to know that our States are loaded up with Ventilators, many brand new and high quality just off of our production lines, and that we are now in a position to help other countries that so desperately need them. Every person needing a Ventilator got one!", "created_at": "Sat Apr 25 14:51:54 +0000 2020", "id_str": "1254060573655998466"}, {"text": "Just spoke to Prime Minister Abiy Ahmed Ali of Ethiopia. His Country needs Ventilators, and the U.S. is in good position to help him. We will!", "created_at": "Sat Apr 25 14:10:21 +0000 2020", "id_str": "1254050117767880706"}, {"text": "Many testing sites are, and have been, open &amp; available. Just passed 5 Million Tests, far more than any other country in the world. In fact, more than all other major countries combined! Don’t believe the Fake News! https://t.co/uTSMAvj7R3", "created_at": "Sat Apr 25 12:59:20 +0000 2020", "id_str": "1254032243770736642"}, {"text": "Thank you to the people of Colorado for the warm and gracious notes and letters sent to me for all of the Ventilators we got for you. It was my great honor! @SenCoryGardner", "created_at": "Sat Apr 25 12:45:55 +0000 2020", "id_str": "1254028869859971072"}, {"text": "Great conversation with President Lenin Moreno of the Republic of Ecuador. We will be sending them desperately needed Ventilators, of which we have recently manufactured many, and helping them in other ways. They are fighting hard against CoronaVirus!", "created_at": "Fri Apr 24 14:59:34 +0000 2020", "id_str": "1253700113383534598"}, {"text": "Just spoke to President Juan Orlando Hernandez of the Republic of Honduras. We work closely together on the Southern Border. Will be helping him with his request for Ventilators and Testing.", "created_at": "Fri Apr 24 14:59:05 +0000 2020", "id_str": "1253699994516946945"}, {"text": "Great conversation with President Lenin Moreno of the Republic of Equador. We will be sending them desperately needed Ventilators, of which we have recently manufactured many, and helping them in other ways. They are fighting hard against CoronaVirus!", "created_at": "Fri Apr 24 14:56:51 +0000 2020", "id_str": "1253699430819250176"}, {"text": "Just spoke to President Nayib Bukele of El Salvador. Will be helping them with Ventilators, which are desperately needed. They have worked well with us on immigration at the Southern Border!", "created_at": "Fri Apr 24 14:20:08 +0000 2020", "id_str": "1253690189144379392"}, {"text": "Just spoke to my friend, President Joko Widodo of the Republic of Indonesia. Asking for Ventilators, which we will provide. Great cooperation between us!", "created_at": "Fri Apr 24 14:12:23 +0000 2020", "id_str": "1253688241947107331"}, {"text": "Great conversation with President Lenin Moreno of the Republic if Equador. We will be sending them desperately needed Ventilators, of which we have recently manufactured many, and helping them in other ways. They are fighting hard against CoronaVirus!", "created_at": "Fri Apr 24 13:59:11 +0000 2020", "id_str": "1253684917038452736"}, {"text": "Getting VERY good reviews of the job the Federal Government is doing on CoronaVirus. Ventilators, building hospitals, beds and yes, Testing, have been handled incredibly well. Testing is getting exponentially better every day. Love seeing our Country safely opening up!", "created_at": "Fri Apr 24 13:38:16 +0000 2020", "id_str": "1253679654734573570"}, {"text": "Please study this closely. We saved many lives with our fast action on CoronaVirus! https://t.co/IKtkciXEEO", "created_at": "Thu Apr 23 12:16:41 +0000 2020", "id_str": "1253296736589807619"}, {"text": ".@foxandfriends  We now have many Ventilators to spare. Thank you to all! https://t.co/brNmQKZ1FL", "created_at": "Thu Apr 23 12:09:54 +0000 2020", "id_str": "1253295028509835264"}, {"text": "CDC Director was totally misquoted by Fake News @CNN on Covid 19. He will be putting out a statement.", "created_at": "Wed Apr 22 14:17:08 +0000 2020", "id_str": "1252964659960971265"}, {"text": "“Economic impact of Covid-19.” @foxandfriends Very interesting analysis. Light at the end of the tunnel. Thank you!", "created_at": "Wed Apr 22 10:50:19 +0000 2020", "id_str": "1252912612821667840"}, {"text": "I urge the Senate and House to pass the Paycheck Protection Program and Health Care Enhancement Act with additional funding for PPP, Hospitals, and Testing. After I sign this Bill, we will begin discussions on the next Legislative Initiative with fiscal relief....", "created_at": "Tue Apr 21 16:49:12 +0000 2020", "id_str": "1252640538647506947"}, {"text": "....to State/Local Governments for lost revenues from COVID 19, much needed Infrastructure Investments for Bridges, Tunnels, Broadband, Tax Incentives for Restaurants, Entertainment, Sports, and Payroll Tax Cuts to increase Economic Growth.", "created_at": "Tue Apr 21 16:49:12 +0000 2020", "id_str": "1252640539574448128"}, {"text": "Last month all you heard from the Radical Left, Do Nothing Democrats was, “Ventilators, Ventilators, Ventilators.” They screamed it loud &amp; clear, &amp; thought they had us cold, even though it was the State’s task. But everyone got their V’s, with many to spare. Now they scream....", "created_at": "Mon Apr 20 15:37:22 +0000 2020", "id_str": "1252260073839177728"}, {"text": "... “Testing, Testing, Testing,” again playing a very dangerous political game. States, not the Federal Government, should be doing the Testing - But we will work with the Governors and get it done. This is easy compared to the fast production of thousands of complex Ventilators!", "created_at": "Mon Apr 20 15:37:22 +0000 2020", "id_str": "1252260074782887941"}, {"text": "“On February 19th there was a Democratic Debate, in Las Vegas. Three words weren’t said: Virus, CoronaVirus, or COVID19. NEVER came up!” @BretBaier", "created_at": "Sun Apr 19 19:18:05 +0000 2020", "id_str": "1251953233184149504"}, {"text": "Just like I was right on Ventilators (our Country is now the “King of Ventilators”, other countries are calling asking for help-we will!), I am right on testing. Governors must be able to step up and get the job done. We will be with you ALL THE WAY!", "created_at": "Sun Apr 19 16:36:26 +0000 2020", "id_str": "1251912553602654214"}, {"text": "China wants Sleepy Joe sooo badly. They want all of those billions of dollars that they have been paying to the U.S. back, and much more. Joe is an easy mark, their DREAM CANDIDATE! https://t.co/vmvCr4SkQq", "created_at": "Sat Apr 18 19:13:28 +0000 2020", "id_str": "1251589681428520960"}, {"text": "....Example! V.P. Mike Pence held a conference call yesterday with all Democrat Senators. He gave them everything that they would have wanted to hear in terms of gaining ground on the CoronaVirus, but nothing that anyone could have said, including “it’s over”, could have made....", "created_at": "Sat Apr 18 17:20:28 +0000 2020", "id_str": "1251561244106141697"}, {"text": "Spending the morning speaking to @fema and Military relative to CoronaVirus. Also, spoke to leaders of various countries including Poland, South Korea and Bahrain. Last night had a very gold conversation with the President of Mexico on numerous topics. Border is very strong!", "created_at": "Sat Apr 18 15:51:25 +0000 2020", "id_str": "1251538837328797699"}, {"text": "Cuomo ridiculously wanted “40 thousand Ventilators”. We gave him a small fraction of that number, and it was plenty. State should have had them in stockpile!", "created_at": "Fri Apr 17 17:00:01 +0000 2020", "id_str": "1251193712580968450"}, {"text": "The States have to step up their TESTING!", "created_at": "Fri Apr 17 16:32:43 +0000 2020", "id_str": "1251186839983132673"}, {"text": "China has just announced a doubling in the number of their deaths from the Invisible Enemy. It is far higher than that and far higher than the U.S., not even close!", "created_at": "Fri Apr 17 16:30:05 +0000 2020", "id_str": "1251186179548033025"}, {"text": "Governor Cuomo should spend more time “doing” and less time “complaining”. Get out there and get the job done. Stop talking! We built you thousands of hospital beds that you didn’t need or use, gave large numbers of Ventilators that you should have had, and helped you with....", "created_at": "Fri Apr 17 16:11:45 +0000 2020", "id_str": "1251181563506757632"}, {"text": "....testing that you should be doing. We have given New York far more money, help and equipment than any other state, by far, &amp; these great men &amp; women who did the job never hear you say thanks. Your numbers are not good. Less talk and more action!", "created_at": "Fri Apr 17 16:11:45 +0000 2020", "id_str": "1251181566740619265"}, {"text": "Why did the W.H.O. Ignore an email from Taiwanese health officials in late December alerting them to the possibility that CoronaVirus could be transmitted between humans? Why did the W.H.O. make several claims about the CoronaVirus that ere either inaccurate or misleading....", "created_at": "Fri Apr 17 13:20:29 +0000 2020", "id_str": "1251138462968922119"}, {"text": "Crazy Nancy Pelosi deleted this from her Twitter account. She wanted everyone to pack into Chinatown long after I closed the BORDER TO CHINA. Based on her statement, she is responsible for many deaths. She’s an incompetent, third-rate politician! https://t.co/uWNI7DCG3o", "created_at": "Thu Apr 16 18:24:30 +0000 2020", "id_str": "1250852583318736896"}, {"text": "Cuomo’s been calling daily, even hourly, begging for everything, most of which should have been the state’s responsibility, such as new hospitals, beds, ventilators, etc. I got it all done for him, and everyone else, and now he seems to want Independence! That won’t happen!", "created_at": "Tue Apr 14 14:07:11 +0000 2020", "id_str": "1250063051182747651"}, {"text": "Having been involved in the negotiations, to put it mildly, the number that OPEC+ is looking to cut is 20 Million Barrels a day, not the 10 Million that is generally being reported. If anything near this happens, and the World gets back to business from the Covid 19.....", "created_at": "Mon Apr 13 13:31:19 +0000 2020", "id_str": "1249691637040795654"}, {"text": "The @nytimes story is a Fake, just like the “paper” itself. I was criticized for moving too fast when I issued the China Ban, long before most others wanted to do so. @SecAzar told me nothing until later, and Peter Navarro memo was same as Ban (see his statements). Fake News!", "created_at": "Mon Apr 13 02:08:16 +0000 2020", "id_str": "1249519742093864961"}, {"text": "The @nytimes story is a Fake, just like the “paper” itself. I was criticized for moving too fast when I issued the China Ban, long before most others wanted to do so. @SecAzar told me nothing until later, and @PeterNavarroUSA memo was same as Ban (see his statements). Fake News!", "created_at": "Mon Apr 13 01:09:56 +0000 2020", "id_str": "1249505062554144768"}, {"text": "Sorry Fake News, it’s all on tape. I banned China long before people spoke up. Thank you @OANN https://t.co/d40JQkUZg5", "created_at": "Sun Apr 12 22:51:33 +0000 2020", "id_str": "1249470237726081030"}, {"text": "Governors, get your states testing programs &amp; apparatus perfected. Be ready, big things are happening. No excuses! The Federal Government is there to help. We are testing more than any country in the World. Also, gear up with Face Masks!", "created_at": "Sun Apr 12 21:43:10 +0000 2020", "id_str": "1249453028178001920"}, {"text": "If the Fake News Opposition Party is pushing, with all their might, the fact that President Trump “ignored early warnings about the threat,” then why did Media &amp; Dems viciously criticize me when I instituted a Travel Ban on China? They said “early &amp; not necessary.” Corrupt Media!", "created_at": "Sun Apr 12 20:43:12 +0000 2020", "id_str": "1249437936539631616"}, {"text": "Great businessman &amp; philanthropist Bernie Marcus, Co-Founder of Home Depot, said that Congress was too distracted by the (phony) Impeachment Witch Hunt when they should have been investigating  CoronaVirus when it first appeared in China. Media played a big roll also!@dcexaminer", "created_at": "Sun Apr 12 16:14:52 +0000 2020", "id_str": "1249370410422095872"}, {"text": "Great businessman &amp; philanthropist Bernies Marcus, Co-Founder of Home Depot, said that Congress was too distracted by the (phony) Impeachment Witch Hunt when they should have been investigating  CoronaVirus when it first appeared in China. Media played a big roll also!@dcexaminer", "created_at": "Sun Apr 12 16:10:38 +0000 2020", "id_str": "1249369344540377089"}, {"text": "A very good sign is that empty hospital beds are becoming more and more prevalent. We deployed 418 Doctors, Nurses and Respiratory Therapists from the hospital ship Comfort and the Javits Convention Center to hospitals in NYC &amp; State. Have more bed capacity than was needed. Good!", "created_at": "Sun Apr 12 14:21:03 +0000 2020", "id_str": "1249341768157495296"}, {"text": "So now the Fake News @nytimes is tracing the CoronaVirus origins back to Europe, NOT China. This is a first! I wonder what the Failing New York Times got for this one? Are there any NAMED sources? They were recently thrown out of China like dogs, and obviously want back in. Sad!", "created_at": "Sat Apr 11 23:34:58 +0000 2020", "id_str": "1249118778404765696"}, {"text": "The Wall Street Journal Editorial Board doesn’t have a clue on how to fight and win. Their views on Tariffs &amp; Trade are losers for the U.S., but winners for other countries, including China. If we followed their standards,  we’d have no Country left. They should love Sleepy Joe!", "created_at": "Sat Apr 11 22:35:35 +0000 2020", "id_str": "1249103831994118146"}, {"text": "So now the Fake News @nytimes is tracing the CoronaVirus origins back to Europe, NOT China. This is a first! I wonder where the Failing New York Times got for this one? Are there any NAMED sources? They were recently thrown out of China like dogs, and obviously want back in. Sad!", "created_at": "Sat Apr 11 22:27:01 +0000 2020", "id_str": "1249101675509370882"}, {"text": "So now the Fake News @nytimes is tracing the CoronaVirus origins back to Europe, NOT China. This is a first! I wonder what the Failing New York Times got for this one? Are there any NAMED sources? They were recently thrown out of China like dogs, and obviously want back in. Sad!", "created_at": "Sat Apr 11 22:22:58 +0000 2020", "id_str": "1249100658692648962"}, {"text": ".@OANN  A key CoronaVirus Model is now predicting far fewer deaths than the number shown in earlier models. That’s because the American people are doing a great job. Social Distancing etc. Keep going!", "created_at": "Thu Apr 09 15:08:05 +0000 2020", "id_str": "1248266439582244866"}, {"text": "Will be immediately sending 100 Ventilators to Colorado at the request of Senator Gardner! https://t.co/Nj4EPxfZl6", "created_at": "Wed Apr 08 12:46:01 +0000 2020", "id_str": "1247868300647968771"}, {"text": "“The number of New Yorkers admitted to hospitals has dropped.” @ainsleyearhardt @foxandfriends  Good news!", "created_at": "Wed Apr 08 12:07:27 +0000 2020", "id_str": "1247858593740832772"}, {"text": "The W.H.O. really blew it. For some reason, funded largely by the United States, yet very China centric. We will be giving that a good look. Fortunately I rejected their advice on keeping our borders open to China early on. Why did they give us such a faulty recommendation?", "created_at": "Tue Apr 07 15:04:16 +0000 2020", "id_str": "1247540701291638787"}, {"text": "For humanitarian reasons, the passengers from the two CoronaVirus stricken cruise ships have been given medical treatment and, when appropriate, allowed to disembark, under strict supervision. Very carefully done. People we’re dying &amp; no other countries would allow them to dock!", "created_at": "Mon Apr 06 11:49:57 +0000 2020", "id_str": "1247129414485397504"}, {"text": "I will be having a White House CoronaVirus Task Force meeting in a short while. May or may not do a News Conference after the meeting, depending on new information. Talks &amp; meetings today are proving promising, but a rough two weeks are coming up!", "created_at": "Sun Apr 05 19:30:11 +0000 2020", "id_str": "1246882848872726529"}, {"text": "America owes our very hard working food supply workers so much as they produce and deliver high quality food for us during this horrible COVID-19. Join me in thanking our Farmers, Ranchers, Processors, Distributors and Stores! @JohnBoozman", "created_at": "Sat Apr 04 19:10:23 +0000 2020", "id_str": "1246515478908076034"}, {"text": "....have been stocked up and ready long before this crisis hit. Other states are thrilled with the job we have done. Sending many Ventilators today, with thousands being built. 51 large cargo planes coming in with medical supplies. Prefer sending directly to hospitals.", "created_at": "Thu Apr 02 13:17:22 +0000 2020", "id_str": "1245701859697967105"}, {"text": "Massive amounts of medical supplies, even hospitals and medical centers, are being delivered directly to states and hospitals by the Federal Government. Some have insatiable appetites &amp; are never satisfied (politics?). Remember, we are a backup for them. The complainers should...", "created_at": "Thu Apr 02 13:17:21 +0000 2020", "id_str": "1245701858863329281"}, {"text": "Somebody please explain to Cryin’ Chuck Schumer that we do have a military man in charge of distributing goods, a very talented Admiral, in fact. New York has gotten far more than any other State, including hospitals &amp; a hospital ship, but no matter what, always complaining.....", "created_at": "Thu Apr 02 12:57:41 +0000 2020", "id_str": "1245696906560487425"}, {"text": "30 DAYS TO SLOW THE SPREAD\n#COVIDー19 https://t.co/p9j7kZsD7b https://t.co/RSUHRfT8If", "created_at": "Tue Mar 31 23:49:05 +0000 2020", "id_str": "1245136063187869698"}, {"text": "So proud of the @USACEHQ, @FEMA, and the Federal Government for the 2,900 bed hospital they built in 4 days (way ahead of schedule) in the Javits Center for NY. We are now moving the teams to join others so they can continue to build more hospitals/beds. Keep up the GREAT WORK!", "created_at": "Sun Mar 29 20:06:35 +0000 2020", "id_str": "1244355295033331718"}, {"text": "“President Trump is a ratings hit. Since reviving the daily White House briefing Mr. Trump and his coronavirus updates have attracted an average audience of 8.5 million on cable news, roughly the viewership of the season finale of ‘The Bachelor.’ Numbers are continuing to rise...", "created_at": "Sun Mar 29 17:48:36 +0000 2020", "id_str": "1244320570315018240"}, {"text": "On the recommendation of the White House CoronaVirus Task Force, and upon consultation with the Governor’s of New York, New Jersey and Connecticut, I have asked the @CDCgov to issue a strong Travel Advisory, to be administered by the Governors, in consultation with the....", "created_at": "Sun Mar 29 00:19:25 +0000 2020", "id_str": "1244056534583312384"}, {"text": "Thousand of Federal Government (delivered) Ventilators found in New York storage. N.Y. must distribute NOW!", "created_at": "Fri Mar 27 15:50:15 +0000 2020", "id_str": "1243566007605755904"}, {"text": "We have just purchased many Ventilators from some wonderful companies. Names and numbers will be announced later today!", "created_at": "Fri Mar 27 15:31:33 +0000 2020", "id_str": "1243561301768581120"}, {"text": "General Motors MUST immediately open their stupidly abandoned Lordstown plant in Ohio, or some other plant, and START MAKING VENTILATORS, NOW!!!!!!  FORD, GET GOING ON VENTILATORS, FAST!!!!!!  @GeneralMotors  @Ford", "created_at": "Fri Mar 27 15:23:53 +0000 2020", "id_str": "1243559373395410957"}, {"text": "As usual with “this” General Motors, things just never seem to work out. They said they were going to give us 40,000 much needed Ventilators, “very quickly”. Now they are saying it will only be 6000, in late April, and they want top dollar. Always a mess with Mary B. Invoke “P”.", "created_at": "Fri Mar 27 15:16:07 +0000 2020", "id_str": "1243557418556162050"}, {"text": "Just finished a very good conversation with President Xi of China. Discussed in great detail the CoronaVirus that is ravaging large parts of our Planet. China has been through much &amp; has developed a strong understanding of the Virus. We are working closely together. Much respect!", "created_at": "Fri Mar 27 05:19:02 +0000 2020", "id_str": "1243407157321560071"}, {"text": "The four hospitals that we (FEMA) are building in NYC at the Javits Convention Center are moving along very well, ahead of schedule. Many additional ventilators also delivered. Good conversation with Governor Cuomo!", "created_at": "Wed Mar 25 14:49:56 +0000 2020", "id_str": "1242826052310794240"}, {"text": "Just reported that the United States has done far more “testing” than any other nation, by far! In fact, over an eight day span, the United States now does more testing than what South Korea (which has been a very successful tester) does over an eight week span. Great job!", "created_at": "Wed Mar 25 14:44:17 +0000 2020", "id_str": "1242824631230308353"}, {"text": "I am working very hard to help New York City &amp; State. Dealing with both Mayor &amp; Governor and producing tremendously for them, including four new medical centers and four new hospitals. Fake News that I won’t help them because I don’t like Cuomo (I do). Just sent 4000 ventilators!", "created_at": "Wed Mar 25 10:40:52 +0000 2020", "id_str": "1242763375924391936"}, {"text": "“President Trump’s decision to very early on restrict travel from China saved tens of thousands of lives.”  @LouDobbs @FoxBusiness", "created_at": "Wed Mar 25 10:14:23 +0000 2020", "id_str": "1242756708902076417"}, {"text": "The World market for face masks and ventilators is Crazy. We are helping the states to get equipment, but it is not easy. Just got 400 Ventilators for @NYCMayor Bill de Blasio. Work beginning on 4 hospitals in New York! Millions of different type items coming!", "created_at": "Tue Mar 24 10:14:36 +0000 2020", "id_str": "1242394374224392192"}, {"text": "The Hill/HarrisX: 61% to 39% Approval Rating on handling of Coronavirus situation. Thank you!", "created_at": "Tue Mar 24 03:43:45 +0000 2020", "id_str": "1242296014633086976"}, {"text": "....us since the beginning of this crisis.” They meant the opposite? Forgot to mention that I closed our Country to China (and Europe) very early, long before it was considered acceptable to do so. Sleepy Joe said I was “xenophobic”, but I saved thousands of lives! Fake News!", "created_at": "Tue Mar 24 02:44:49 +0000 2020", "id_str": "1242281185084149762"}, {"text": "A great early result from a drug that will start tomorrow in New York and other places! #COVIDー19 https://t.co/4F4Qk4WFtK", "created_at": "Mon Mar 23 16:05:53 +0000 2020", "id_str": "1242120391054757900"}, {"text": "Ford, General Motors and Tesla are being given the go ahead to make ventilators and other metal products, FAST! @fema  Go for it auto execs, lets see how good you are? @RepMarkMeadows @GOPLeader @senatemajldr", "created_at": "Sun Mar 22 14:25:16 +0000 2020", "id_str": "1241732681366482944"}, {"text": "America’s Private Sector is stepping up to help us be STRONG! Many of the Nation’s distillers, large and small, are producing and donating hand sanitizer to help fight #COVID19. THANK YOU! https://t.co/bcjKA9Janw", "created_at": "Thu Mar 19 22:23:48 +0000 2020", "id_str": "1240765945968234496"}, {"text": "I always treated the Chinese Virus very seriously, and have done a very good job from the beginning, including my very early decision to close the “borders” from China - against the wishes of almost all. Many lives were saved. The Fake News new narrative is disgraceful &amp; false!", "created_at": "Wed Mar 18 11:46:33 +0000 2020", "id_str": "1240243188708839424"}, {"text": "The individual Governors of States, and local officials, must step up their efforts on drive up testing and testing sights, working in conjunction with @CDCgov and the Federal Government!", "created_at": "Sun Mar 15 22:53:05 +0000 2020", "id_str": "1239323762987851778"}, {"text": "There will be a News Conference by the CoronaVirus Task Force today at the White House, 5 P.M. @VP  We are working closely with the Governors of our Country’s great States, which are a very big factor. They are working hard, along with us, to get the job properly done.....", "created_at": "Sun Mar 15 17:02:00 +0000 2020", "id_str": "1239235409491767298"}, {"text": "....The USA was never set up for this, just look at the catastrophe of the H1N1 Swine Flu (Biden in charge, 17,000 people lost, very late response time), but it soon will be. Great decision to close our China, and other, borders early. Saved many lives!", "created_at": "Sun Mar 15 17:02:00 +0000 2020", "id_str": "1239235411463020544"}, {"text": "Just had a nice conversation with Prime Minister @JustinTrudeau of Canada. Great to hear that his wonderful wife Sophie is doing very well. The United States and Canada will continue to coordinate closely together on COVID-19.", "created_at": "Sat Mar 14 19:06:09 +0000 2020", "id_str": "1238904264908582914"}, {"text": "COVID-19 UPDATE https://t.co/xzSHlNiS9K", "created_at": "Sat Mar 14 17:54:49 +0000 2020", "id_str": "1238886316013760519"}, {"text": "Just finished a meeting on Covid-19 in the Situation Room, news conference coming up shortly. https://t.co/JaNDpyMWjL https://t.co/x9lSEXjnea", "created_at": "Sat Mar 14 16:14:08 +0000 2020", "id_str": "1238860976176467969"}, {"text": "Attending meetings on Covid-19 in the White House. Working with States and local governments, many of whom have done a great job. Full report latter!", "created_at": "Sat Mar 14 13:45:56 +0000 2020", "id_str": "1238823680735612930"}, {"text": "Good teamwork between Republicans &amp; Democrats as the House passes the big CoronaVirus Relief Bill. People really pulled together. Nice to see!", "created_at": "Sat Mar 14 11:37:24 +0000 2020", "id_str": "1238791333252399104"}, {"text": "I fully support H.R. 6201: Families First CoronaVirus Response Act, which will be voted on in the House this evening. This Bill will follow my direction for free CoronaVirus tests, and paid sick leave for our impacted American workers. I have directed....", "created_at": "Sat Mar 14 00:42:25 +0000 2020", "id_str": "1238626501555298308"}, {"text": "I will be having a news conference today at 3:00 P.M., The White House. Topic: CoronaVirus!", "created_at": "Fri Mar 13 14:55:34 +0000 2020", "id_str": "1238478818135945216"}, {"text": "To this point, and because we have had a very strong border policy, we have had 40 deaths related to CoronaVirus. If we had weak or open borders, that number would be many times higher!", "created_at": "Fri Mar 13 14:52:59 +0000 2020", "id_str": "1238478167695863817"}, {"text": ".... Their response to H1N1 Swine Flu was a full scale disaster, with thousands dying, and nothing meaningful done to fix the testing problem, until now. The changes have been made and testing will soon happen on a very large scale basis. All Red Tape has been cut, ready to go!", "created_at": "Fri Mar 13 10:22:19 +0000 2020", "id_str": "1238410051758575617"}, {"text": "For decades the @CDCgov looked at, and studied,  its testing system, but did nothing about it. It would always be inadequate and slow for a large scale pandemic, but a pandemic would never happen, they hoped. President Obama made changes that only complicated things further.....", "created_at": "Fri Mar 13 10:22:17 +0000 2020", "id_str": "1238410044263333894"}, {"text": "108 countries are dealing with the CoronaVirus problem, some of which we are helping!", "created_at": "Thu Mar 12 20:02:21 +0000 2020", "id_str": "1238193633825882113"}, {"text": "The Media should view this as a time of unity and strength. We have a common enemy, actually, an enemy of the World, the CoronaVirus. We must beat it as quickly and safely as possible. There is nothing more important to me than the life &amp; safety of the United States!", "created_at": "Wed Mar 11 22:04:26 +0000 2020", "id_str": "1237861968721010689"}, {"text": "I am fully prepared to use the full power of the Federal Government to deal with our current challenge of the CoronaVirus!", "created_at": "Wed Mar 11 19:18:35 +0000 2020", "id_str": "1237820230296010752"}, {"text": "I want to thank all of our Great Government officials on the CoronaVirus Task Force who are working around the clock, in response to the CoronaVirus. Continue to check https://t.co/boZM2NePJW for updates, and follow all recommendations that are available....", "created_at": "Wed Mar 11 19:17:50 +0000 2020", "id_str": "1237820042735226887"}, {"text": "....Together we are putting into policy a plan to prevent, detect, treat and create a vaccine against CoronaVirus to save lives in America and the world. America will get it done!", "created_at": "Wed Mar 11 18:52:45 +0000 2020", "id_str": "1237813728558678026"}, {"text": "Someone needs to tell the Democrats in Congress that CoronaVirus doesn’t care what party you are in. We need to protect ALL Americans!", "created_at": "Wed Mar 11 18:50:10 +0000 2020", "id_str": "1237813081394348034"}, {"text": "Vanity Fair Magazine, which will soon be out of business, and their third rate Fake reporters, who make up sources which don’t exist, wrote yet another phony &amp; boring hit piece. The facts are just the opposite. Our team is doing a great job with CoronaVirus!", "created_at": "Wed Mar 11 14:22:00 +0000 2020", "id_str": "1237745593876873217"}, {"text": "Our CoronaVirus Team has been doing a great job. Even Democrat governors have been VERY complimentary!", "created_at": "Tue Mar 10 14:44:11 +0000 2020", "id_str": "1237388788776800256"}, {"text": "So last year 37,000 Americans died from the common Flu. It averages between 27,000 and 70,000 per year. Nothing is shut down, life &amp; the economy go on. At this moment there are 546 confirmed cases of CoronaVirus, with 22 deaths. Think about that!", "created_at": "Mon Mar 09 14:47:59 +0000 2020", "id_str": "1237027356314869761"}, {"text": "Great job being done by the @VP and the CoronaVirus Task Force. Thank you!", "created_at": "Mon Mar 09 13:11:47 +0000 2020", "id_str": "1237003145743605761"}, {"text": "The Fake News Media and their partner, the Democrat Party, is doing everything within its semi-considerable power (it used to be greater!) to inflame the CoronaVirus situation, far beyond what the facts would warrant. Surgeon General, “The risk is low to the average American.”", "created_at": "Mon Mar 09 11:20:43 +0000 2020", "id_str": "1236975196642390022"}, {"text": "We have a perfectly coordinated and fine tuned plan at the White House for our attack on CoronaVirus. We moved VERY early to close borders to certain areas, which was a Godsend. V.P. is doing a great job. The Fake News Media is doing everything possible to make us look bad. Sad!", "created_at": "Sun Mar 08 12:45:45 +0000 2020", "id_str": "1236634209516752896"}, {"text": "Spoke to Governor @GavinNewsom early this morning about the cruise ship quarantined off the California Coast. CoronaVirus test kits have been delivered, testing is taking place now. https://t.co/Pqda00HVCC", "created_at": "Fri Mar 06 15:47:58 +0000 2020", "id_str": "1235955288064135168"}, {"text": "It is FAKE NEWS that @HHSGov @SecAzar is “sidelined” from the great job he is doing on the CoronaVirus Task Force. He has the total confidence of the @VP and myself, and is doing a fantastic job, as the numbers would indicate!", "created_at": "Fri Mar 06 15:38:06 +0000 2020", "id_str": "1235952805581447173"}, {"text": "Gallup just gave us the highest rating ever for the way we are handling the CoronaVirus situation. The April 2009-10 Swine Flu, where nearly 13,000 people died in the U.S., was poorly handled. Ask MSDNC &amp; lightweight Washington failure @RonaldKlain, who the President was then?", "created_at": "Thu Mar 05 20:34:49 +0000 2020", "id_str": "1235665090432708608"}, {"text": "With approximately 100,000 CoronaVirus cases worldwide, and 3,280 deaths, the United States, because of quick action on closing our borders, has, as of now, only 129 cases (40 Americans brought in) and 11 deaths. We are working very hard to keep these numbers as low as possible!", "created_at": "Thu Mar 05 16:34:21 +0000 2020", "id_str": "1235604572850343937"}, {"text": "“I want to commend the President for how he has handled the CoronaVirus situation, especially his early decision to shut down access into our Country from China, despite strong opposition to that decision.” @SenTomCotton Thank you Tom!", "created_at": "Thu Mar 05 15:53:33 +0000 2020", "id_str": "1235594306297253889"}, {"text": "I NEVER said people that are feeling sick should go to work. This is just more Fake News and disinformation put out by the Democrats, in particular MSDNC. Comcast covers the CoronaVirus situation horribly, only looking to do harm to the incredible &amp; successful effort being made!", "created_at": "Thu Mar 05 14:30:50 +0000 2020", "id_str": "1235573492004904961"}, {"text": "Congress has agreed to provide $8 Billion to fight Coronavirus! This means @CDCgov, @HHSGov, and @DHSgov will have the resources they need to Keep America Safe and keep the risk to workers and families very low. This is great news for our Health, our Economy, and our Nation!", "created_at": "Wed Mar 04 23:46:50 +0000 2020", "id_str": "1235351025349013505"}, {"text": "Congress has agreed to provide $8 Billion to fight Coronavirus! This means @CDC, @HHSGov, and @DHSgov will have the resources they need to Keep America Safe and keep the risk to workers and families very low. This is great news for our Health, our Economy, and our Nation!", "created_at": "Wed Mar 04 23:45:39 +0000 2020", "id_str": "1235350726500659202"}, {"text": "Australia’s Central Bank cut interest rates and stated it will most likely further ease in order to make up for China’s Coronavirus situation and slowdown. They reduced to 0.5%, a record low. Other countries are doing the same thing, if not more so. Our Federal Reserve has us....", "created_at": "Tue Mar 03 06:34:02 +0000 2020", "id_str": "1234728724219691008"}, {"text": "Australia’s Central Bank cut interest rates and stated it will most likely further ease in order to make up for China’s Coronavirus situation and slowdown. They reduced to 0.5%, a record low. Other countries are doing the same thing, if not more so. Our Federal Reserve has us....", "created_at": "Tue Mar 03 06:27:46 +0000 2020", "id_str": "1234727146964254721"}, {"text": "I was criticized by the Democrats when I closed the Country down to China many weeks ahead of what almost everyone recommended. Saved many lives. Dems were working the Impeachment Hoax. They didn’t have a clue! Now they are fear mongering. Be calm &amp; vigilant!", "created_at": "Mon Mar 02 12:55:20 +0000 2020", "id_str": "1234462291652993032"}, {"text": "I am meeting with the major pharmaceutical companies today at the White House about progress on a vaccine and cure. Progress being made!", "created_at": "Mon Mar 02 12:26:23 +0000 2020", "id_str": "1234455007765942273"}, {"text": "A Poll in today’s New York Post says that 77% of “U.S. adults have confidence in their government’s ability to handle the Coronavirus (Number One), compared to other health threats.” 64% for Zika, 58% for Ebola. Others way down on list. Our professionals are doing a great job!", "created_at": "Sun Mar 01 20:17:46 +0000 2020", "id_str": "1234211248373403648"}, {"text": "Coronavirus: In addition to screening travelers “prior to boarding” from certain designated high risk countries, or areas within those countries, they will also be screened when they arrive in America. Thank you! @VP @SecAzar @CDCgov @CDCDirector", "created_at": "Sun Mar 01 13:31:59 +0000 2020", "id_str": "1234109126864707585"}, {"text": "I will be having a 1:30 P.M. Press Conference at the White House to discuss the latest CoronaVirus developments. Thank you!", "created_at": "Sat Feb 29 17:02:35 +0000 2020", "id_str": "1233799741630230530"}, {"text": "The Do Nothing Democrats were busy wasting time on the Immigration Hoax, &amp; anything else they could do to make the Republican Party look bad, while I was busy calling early BORDER &amp; FLIGHT closings, putting us way ahead in our battle with Coronavirus. Dems called it VERY wrong!", "created_at": "Fri Feb 28 05:43:14 +0000 2020", "id_str": "1233266386291580931"}, {"text": "So, the Coronavirus, which started in China and spread to various countries throughout the world, but very slowly in the U.S. because President Trump closed our border, and ended flights, VERY EARLY, is now being blamed, by the Do Nothing Democrats, to be the fault of “Trump”.", "created_at": "Fri Feb 28 05:05:02 +0000 2020", "id_str": "1233256774964273152"}, {"text": "Congratulations and thank you to our great Vice President &amp; all of the many professionals doing such a fine job at CDC &amp; all other agencies on the Coronavirus situation. Only a very small number in U.S., &amp; China numbers look to be going down. All countries working well together!", "created_at": "Fri Feb 28 02:39:20 +0000 2020", "id_str": "1233220106324451328"}, {"text": "Do Nothing Democrats were busy wasting their time on the Impeachment Hoax, &amp; anything they could do to make the Republican Party look bad, while I was busy calling early boarder &amp; flight closings, putting us way ahead in our battle with the Coronavirus. Dems called it very wrong!", "created_at": "Fri Feb 28 02:32:10 +0000 2020", "id_str": "1233218304271167489"}, {"text": "“Anti-Trump Network @CNN doing whatever it can to stoke a national Coronavirus panic. The far left Network pretty much ignoring anyone who they interview who doesn’t blame President Trump.” @trish_regan @FoxNews Media refuses to discuss the great job our professionals are doing!", "created_at": "Fri Feb 28 01:53:59 +0000 2020", "id_str": "1233208695099666433"}, {"text": "Just landed. India was great, trip very successful. Heading to the White House. Meetings and calls scheduled today. @CDCgov, @SecAzar and all doing a great job with respect to Coronavirus! Briefing this afternoon.", "created_at": "Wed Feb 26 11:39:45 +0000 2020", "id_str": "1232631333408649216"}, {"text": "“U.S. acted on the Coronavirus very, very quickly.” Gordon Chang  @IngrahamAngle", "created_at": "Wed Feb 26 07:19:49 +0000 2020", "id_str": "1232565919043317761"}, {"text": "CDC and my Administration are doing a GREAT job of handling Coronavirus, including the very early closing of our borders to certain areas of the world. It was opposed by the Dems, “too soon”, but turned out to be the correct decision. No matter how well we do, however, the.....", "created_at": "Wed Feb 26 02:29:21 +0000 2020", "id_str": "1232492821501771776"}, {"text": "Cryin’ Chuck Schumer is complaining, for publicity purposes only, that I should be asking for more money than $2.5 Billion to prepare for Coronavirus. If I asked for more he would say it is too much. He didn’t like my early travel closings. I was right. He is incompetent!", "created_at": "Tue Feb 25 14:02:15 +0000 2020", "id_str": "1232304804820467714"}, {"text": "The Coronavirus is very much under control in the USA. We are in contact with everyone and all relevant countries. CDC &amp; World Health have been working hard and very smart. Stock Market starting to look very good to me!", "created_at": "Mon Feb 24 21:42:02 +0000 2020", "id_str": "1232058127740174339"}, {"text": "IF OUR FORMALLY TARGETED FARMERS NEED ADDITIONAL AID UNTIL SUCH TIME AS THE TRADE DEALS WITH CHINA, MEXICO, CANADA AND OTHERS FULLY KICK IN, THAT AID WILL BE PROVIDED BY THE FEDERAL GOVERNMENT, PAID FOR OUT OF THE MASSIVE TARIFF MONEY COMING INTO THE USA!", "created_at": "Fri Feb 21 15:24:28 +0000 2020", "id_str": "1230875946334318593"}, {"text": "....product and goods to China and other countries. That’s what trade is all about. We don’t want to make it impossible to do business with us. That will only mean that orders will go to someplace else. As an example, I want China to buy our jet engines, the best in the World....", "created_at": "Tue Feb 18 15:29:43 +0000 2020", "id_str": "1229790100797739008"}, {"text": "....product and goods to China and other countries. That’s what trade is all about. We don’t want to make it impossible to do business with us. That will only mean that orders will go to someplace else. As an example, I want China to buy our jet engines, the best in the World....", "created_at": "Tue Feb 18 14:37:04 +0000 2020", "id_str": "1229776851297558529"}, {"text": "....he will be successful, especially as the weather starts to warm &amp; the virus hopefully becomes weaker, and then gone. Great discipline is taking place in China, as President Xi strongly leads what will be a very successful operation. We are working closely with China to help!", "created_at": "Fri Feb 07 10:31:23 +0000 2020", "id_str": "1225728756456808448"}, {"text": "Just had a long and very good conversation by phone with President Xi of China. He is strong, sharp and powerfully focused on leading the counterattack on the Coronavirus. He feels they are doing very well, even building hospitals in a matter of only days. Nothing is easy, but...", "created_at": "Fri Feb 07 10:31:22 +0000 2020", "id_str": "1225728755248828416"}, {"text": "Republicans in Iowa, go out and Caucus today. Your great Trade Deals with China, Mexico, Canada, Japan, South Korea and more, are DONE. Great times are coming, after waiting for decades, for our Farmers, Ranchers, Manufacturers and ALL. Nobody else could have pulled this off!", "created_at": "Mon Feb 03 16:51:40 +0000 2020", "id_str": "1224374908710420480"}, {"text": "Working closely with China and others on Coronavirus outbreak. Only 5 people in U.S., all in good recovery.", "created_at": "Thu Jan 30 22:04:35 +0000 2020", "id_str": "1223004106408833025"}, {"text": "Just received a briefing on the Coronavirus in China from all of our GREAT agencies, who are also working closely with China. We will continue to monitor the ongoing developments. We have the best experts anywhere in the world, and they are on top of it 24/7! https://t.co/rrtF1Stk78", "created_at": "Thu Jan 30 00:06:52 +0000 2020", "id_str": "1222672488934584324"}, {"text": "We are in very close communication with China concerning the virus. Very few cases reported in USA, but strongly on watch. We have offered China and President Xi any help that is necessary. Our experts are extraordinary!", "created_at": "Mon Jan 27 14:56:21 +0000 2020", "id_str": "1221809170673958913"}, {"text": "China has been working very hard to contain the Coronavirus. The United States greatly appreciates their efforts and transparency. It will all work out well. In particular, on behalf of the American People, I want to thank President Xi!", "created_at": "Fri Jan 24 21:18:15 +0000 2020", "id_str": "1220818115354923009"}, {"text": "“He’s got to explain this. How did Hunter Biden get a billion and a half dollars (from China) to invest when he’d been in business for 60 days?” @LindseyGrahamSC @FoxNews", "created_at": "Fri Jan 24 11:42:37 +0000 2020", "id_str": "1220673252764332037"}, {"text": "One of the many great things about our just signed giant Trade Deal with China is that it will bring both the USA &amp; China closer together in so many other ways. Terrific working with President Xi, a man who truly loves his country. Much more to come!", "created_at": "Wed Jan 22 18:03:06 +0000 2020", "id_str": "1220044230065655808"}, {"text": "I will be going to Austin, Texas. Leaving soon. Always like (love!) being in the Lone Star State. Speaking to our great Farmers. They hit “paydirt” with our incredible new Trade Deals: CHINA, JAPAN, MEXICO, CANADA, SOUTH KOREA, and many others!", "created_at": "Sun Jan 19 17:44:56 +0000 2020", "id_str": "1218952496388956162"}, {"text": "The farmers are really happy with the new China Trade Deal and the soon to be signed deal with Mexico and Canada, but I hope the thing they will most remember is the fact that I was able to take massive incoming Tariff money and use it to help them get through the tough times!", "created_at": "Thu Jan 16 15:14:29 +0000 2020", "id_str": "1217827468230434818"}, {"text": "Cryin’ Chuck Schumer is saying privately that the new China Trade Deal is  unbelievable, which it is, but publicly he knocks it whenever possible. That’s politics, but so bad for our great Country!", "created_at": "Thu Jan 16 13:59:15 +0000 2020", "id_str": "1217808535091916800"}, {"text": "One of the greatest trade deals ever made! Also good for China and our long term relationship. 250 Billion Dollars will be coming back to our Country, and we are now in a great position for a Phase Two start. There has never been anything like this in U.S. history! USMCA NEXT!", "created_at": "Thu Jan 16 13:41:21 +0000 2020", "id_str": "1217804029599920128"}, {"text": "National Security Adviser suggested today that sanctions &amp; protests have Iran “choked off”, will force them to negotiate. Actually, I couldn’t care less if they negotiate. Will be totally up to them but, no nuclear weapons and “don’t kill your protesters.”", "created_at": "Sun Jan 12 23:46:18 +0000 2020", "id_str": "1216506722153639942"}, {"text": "The government of Iran must allow human rights groups to monitor and report facts from the ground on the ongoing protests by the Iranian people. There can not be another massacre of peaceful protesters, nor an internet shutdown. The world is watching.", "created_at": "Sat Jan 11 22:11:03 +0000 2020", "id_str": "1216120362230067202"}, {"text": "To the brave, long-suffering people of Iran: I've stood with you since the beginning of my Presidency, and my Administration will continue to stand with you. We are following your protests closely, and are inspired by your courage.", "created_at": "Sat Jan 11 21:46:18 +0000 2020", "id_str": "1216114135529902081"}, {"text": "I will be signing our very large and comprehensive Phase One Trade Deal with China on January 15. The ceremony will take place at the White House. High level representatives of China will be present. At a later date I will be going to Beijing where talks will begin on Phase Two!", "created_at": "Tue Dec 31 14:16:40 +0000 2019", "id_str": "1212014713808273410"}]